Repository: kylianvo/uphill-ai
Catalog: ios-native/UphillAI/Resources/Localizable.xcstrings
Source language: en
Languages: vi

source: Saved. Your next week will use these.
vi: Đã lưu. Tuần sau sẽ dùng các thông tin này.

source: Schedule
vi: Lịch

source: Schedule Proposal
vi: Đề xuất lịch

source: Scientific Literature & Principles
vi: Tài liệu khoa học & nguyên tắc

source: Scroll down and tap Workout.
vi: Cuộn xuống và chạm Workout.

source: Search Athletes
vi: Tìm học viên

source: Search athletes by name or email...
vi: Tìm học viên theo tên hoặc email...

source: Search race name or enter manually
vi: Tìm tên Race hoặc nhập tay

source: Search topics, keywords or #tags...
vi: Tìm chủ đề, từ khóa hoặc #tag...

source: Seconds
vi: Giây

source: Section
vi: Đoạn

source: See my plan
vi: Xem plan

source: Select Heart Rate & Power Zones > Heart Rate > Zones.
vi: Chọn Heart Rate & Power Zones > Heart Rate > Zones.

source: Select Shoes
vi: Chọn giày

source: Select Threshold Heart Rate Zone (or Max HR Zone).
vi: Chọn Threshold Heart Rate Zone (hoặc Max HR Zone).

source: Select a recommended model below or configure your current pair.
vi: Chọn một mẫu gợi ý bên dưới hoặc nhập đôi bạn đang dùng.

source: Select all formats you can digest during high intensity:
vi: Chọn mọi dạng bạn tiêu hóa được khi chạy cường độ cao:

source: Select your perceived effort (1 to 10)
vi: Chọn mức gắng sức (1 đến 10)

source: Select your perceived effort for the block (1 to 10)
vi: Chọn mức gắng sức cho Block (1 đến 10)

source: Send message
vi: Gửi tin nhắn

source: Send next 4 weeks to COROS
vi: Gửi 4 tuần tới sang COROS

source: Send to COROS
vi: Gửi sang COROS

source: Sending…
vi: Đang gửi…

source: Sent %lld workouts to COROS through %@.
vi: Đã gửi %lld buổi tập sang COROS tới %@.

source: Sent to COROS
vi: Đã gửi sang COROS

source: Sent to COROS · %@
vi: Đã gửi sang COROS · %@

source: Session
vi: Buổi

source: Session Details
vi: Chi tiết buổi tập

source: Session intent or prompt...
vi: Mục đích buổi tập hoặc yêu cầu...

source: Set %@ as my target
vi: Đặt %@ làm mục tiêu

source: Set New Password
vi: Đặt mật khẩu mới

source: Set your long-run day
vi: Đặt ngày Long Run

source: Setup progress
vi: Tiến độ thiết lập

source: Sex
vi: Giới tính

source: Share / Export .ics File
vi: Chia sẻ / xuất file .ics

source: Sharpen your plan
vi: Làm plan sát hơn

source: Shoe Recommendations
vi: Gợi ý giày

source: Shoe Rotation
vi: Giày xoay vòng

source: Shoe rotation & recommendations
vi: Giày xoay vòng & gợi ý

source: Short intervals & steep climbs
vi: Interval ngắn & dốc gắt

source: Show Less
vi: Thu gọn

source: Shuffle
vi: Xáo trộn

source: Sign in
vi: Đăng nhập

source: Sign out
vi: Đăng xuất

source: Sign out after switching: sessions don't carry across backends.
vi: Đăng xuất sau khi đổi: phiên đăng nhập không dùng chung giữa các backend.

source: Significant deconditioning — starting nearly fresh
vi: Thể lực giảm nhiều, gần như bắt đầu lại

source: Slot
vi: Vị trí

source: Smooth Zone 2 aerobic
vi: Aerobic Zone 2 đều

source: So I don't start you too hard.
vi: Để tôi không cho bạn bắt đầu quá nặng.

source: Sodium per hour
vi: Sodium mỗi giờ

source: Solid
vi: Đồ ăn đặc

source: Solid consistency
vi: Tập đều đặn

source: Something went wrong (%lld). Please try again.
vi: Có lỗi xảy ra (%lld). Vui lòng thử lại.

source: Soon
vi: Sắp có

source: Source
vi: Nguồn

source: Source added to indexing queue
vi: Đã thêm nguồn vào hàng chờ

source: Sources & Evidence
vi: Nguồn & bằng chứng

source: Sources (%lld)
vi: Nguồn (%lld)

source: Split Execution Strategy
vi: Chiến thuật Split

source: Split Interval
vi: Khoảng cách Split

source: Stale
vi: Cũ

source: Start
vi: Xuất phát

source: Start Time (Clock)
vi: Giờ xuất phát

source: Start a new plan?
vi: Bắt đầu plan mới?

source: Start date
vi: Ngày bắt đầu

source: Start new plan
vi: Bắt đầu plan mới

source: Start running
vi: Bắt đầu chạy

source: Start today or later.
vi: Bắt đầu từ hôm nay trở đi.

source: Starting from %lld km a week
vi: Bắt đầu từ %lld km/tuần

source: Steady rhythm for trail climbing
vi: Nhịp đều khi leo dốc trail

source: Step %lld of %lld
vi: Bước %lld / %lld

source: Step-by-step instructions for Garmin, COROS & Apple Watch
vi: Hướng dẫn từng bước cho Garmin, COROS & Apple Watch

source: Still working. Plans with a race far away take longer.
vi: Vẫn đang làm. Plan cho Race còn xa sẽ lâu hơn.

source: Stretch
vi: Thử thách

source: Struggling to hit the paces
vi: Khó giữ đúng pace

source: Subscribe in Apple Calendar (webcal)
vi: Đăng ký trên Apple Calendar (webcal)

source: Suggested %@
vi: Gợi ý %@

source: Suggested Questions
vi: Câu hỏi gợi ý

source: Sun
vi: CN

source: Sunday
vi: Chủ Nhật

source: Surface
vi: Mặt đường

source: Suunto: Suunto App > Profile > Watch Settings > Intensity Zones.
vi: Suunto: app Suunto > Profile > Watch Settings > Intensity Zones.

source: Swap
vi: Đổi

source: Sync Watch Activities
vi: Đồng bộ hoạt động từ đồng hồ

source: Sync failed. Please try again.
vi: Đồng bộ thất bại. Vui lòng thử lại.

source: Sync now
vi: Đồng bộ ngay

source: Sync successful: fetched %lld workouts and %lld days of health data.
vi: Đồng bộ xong: lấy %lld buổi tập và %lld ngày dữ liệu sức khỏe.

source: Synced
vi: Đã đồng bộ

source: Synced %lld activities from watch
vi: Đã đồng bộ %lld hoạt động từ đồng hồ

source: Synced automatically via watch integration
vi: Tự đồng bộ qua kết nối đồng hồ

source: Syncing to Calendar...
vi: Đang đồng bộ vào lịch...

source: Syncing…
vi: Đang đồng bộ…

source: TARGET GOAL TIERS
vi: CÁC MỨC MỤC TIÊU

source: TARGET RACE
vi: RACE MỤC TIÊU

source: TARGET TIME & STRATEGY
vi: MỤC TIÊU THỜI GIAN & CHIẾN THUẬT

source: THIS WEEK FOCUS
vi: TRỌNG TÂM TUẦN NÀY

source: TIME
vi: THỜI GIAN

source: TIME SINCE RACE
vi: THỜI GIAN TỪ RACE

source: TIMELINE
vi: LỘ TRÌNH

source: TODAY
vi: HÔM NAY

source: TOOLS & LABS
vi: CÔNG CỤ

source: TOTAL CARBS
vi: TỔNG CARBS

source: TOTAL SODIUM
vi: TỔNG SODIUM

source: TRAIL FINISHES
vi: SỐ LẦN VỀ ĐÍCH TRAIL

source: Tap + to add a race or link your UTMB/VBM profile.
vi: Chạm + để thêm Race hoặc liên kết hồ sơ UTMB/VBM.

source: Tap Heart Rate Zones (calculated automatically or manual).
vi: Chạm Heart Rate Zones (tự tính hoặc nhập tay).

source: Tap More (...) > Settings > User Settings.
vi: Chạm More (...) > Settings > User Settings.

source: Tap to assign shoe
vi: Chạm để gán giày

source: Tap to dismiss
vi: Chạm để đóng

source: Tap to read coach takeaways and weekly focus
vi: Chạm để đọc điểm chính và trọng tâm tuần

source: Target
vi: Mục tiêu

source: Target Applied
vi: Đã áp dụng mục tiêu

source: Target Finish Time
vi: Thời gian về đích mục tiêu

source: Target Finish: %@
vi: Mục tiêu về đích: %@

source: Target Intensity Zone
vi: Zone cường độ mục tiêu

source: Target Race
vi: Race mục tiêu

source: Target Time
vi: Thời gian mục tiêu

source: Target time %@
vi: Thời gian mục tiêu %@

source: Target time & field percentile
vi: Thời gian mục tiêu & bách phân vị

source: Target: %@
vi: Mục tiêu: %@

source: Target: 80%
vi: Mục tiêu: 80%

source: Technical & Mountain
vi: Kỹ thuật & núi

source: Tell me about injuries
vi: Cho tôi biết về chấn thương

source: Temperature
vi: Nhiệt độ

source: Terrain
vi: Địa hình

source: Terrain near me
vi: Địa hình gần tôi

source: Thanks for feedback! 👍
vi: Cảm ơn góp ý! 👍

source: Thanks! 👍
vi: Cảm ơn! 👍

source: That change couldn't be made.
vi: Không thực hiện được thay đổi.

source: That change isn't valid.
vi: Thay đổi này không hợp lệ.

source: That week is outside your plan.
vi: Tuần đó nằm ngoài plan.

source: That's %lld weeks away
vi: Còn %lld tuần nữa

source: The athlete must already have an Uphill AI account.
vi: Học viên cần có sẵn tài khoản Uphill AI.

source: These changes apply starting with Block %lld
vi: Thay đổi áp dụng từ Block %lld

source: This logs the session as missed and notifies Coach Uphill to balance upcoming load.
vi: Buổi này sẽ được ghi là bị lỡ và Coach Uphill sẽ cân lại khối lượng sắp tới.

source: This plan has no start date, so only same-week day swaps are possible.
vi: Plan chưa có ngày bắt đầu, nên chỉ đổi được ngày trong cùng tuần.

source: This session drives your primary training stimulus this week. Stay disciplined on the target zone.
vi: Đây là buổi tập chính của tuần. Giữ đúng zone mục tiêu.

source: This session was created for the athlete and is awaiting your review.
vi: Buổi này được tạo cho học viên và đang chờ bạn duyệt.

source: This sets the shape of your whole plan.
vi: Lựa chọn này định hình cả plan.

source: This usually takes under a minute. You can leave this screen; we'll keep working.
vi: Thường mất chưa tới một phút. Bạn có thể rời màn hình này, app vẫn tiếp tục làm.

source: This week
vi: Tuần này

source: This will permanently delete your training plan and all scheduled workouts. This action cannot be undone.
vi: Plan và mọi buổi tập đã xếp sẽ bị xóa vĩnh viễn. Không thể hoàn tác.

source: This will permanently remove the workout from the runner's training schedule.
vi: Buổi tập sẽ bị xóa vĩnh viễn khỏi lịch của runner.

source: This workout is already completed or matched to an activity, so it can't be moved.
vi: Buổi tập đã xong hoặc đã khớp với hoạt động, nên không chuyển được.

source: This workout isn't in your active plan.
vi: Buổi tập này không thuộc plan đang chạy.

source: Threshold Pace
vi: Pace Threshold

source: Threshold Pace:
vi: Pace Threshold:

source: Threshold pace
vi: Pace Threshold

source: Thu
vi: T5

source: Thursday
vi: Thứ Năm

source: Time
vi: Thời gian

source: Time (4:45:00)
vi: Thời gian (4:45:00)

source: Time (mins)
vi: Thời gian (phút)

source: Time Target
vi: Mục tiêu thời gian

source: Title
vi: Tiêu đề

source: To subscribe in Google Calendar or Outlook on the web, copy the subscription link above and select "Add Calendar from URL".
vi: Để đăng ký trên Google Calendar hoặc Outlook web, sao chép link ở trên và chọn "Add Calendar from URL".

source: Toggle data sources used by the estimation engine:
vi: Bật/tắt nguồn dữ liệu dùng để ước tính:

source: Tools & Labs
vi: Công cụ

source: Total %lld weeks progression
vi: Lộ trình tổng %lld tuần

source: Total Finishers
vi: Tổng người về đích

source: Trail & ultra endurance coaching grounded in science.
vi: Huấn luyện Trail & Ultra dựa trên khoa học.

source: Trail Terrain Types
vi: Loại địa hình Trail

source: Training
vi: Tập luyện

source: Training Phase
vi: Giai đoạn tập

source: Training Preferences & Constraints
vi: Tùy chọn & giới hạn tập luyện

source: Training Zones
vi: Zone tập luyện

source: Training profile
vi: Hồ sơ tập luyện

source: Training zones
vi: Zone tập luyện

source: Transition
vi: Chuyển tiếp

source: Treadmill max incline
vi: Độ dốc tối đa Treadmill

source: Try again
vi: Thử lại

source: Try searching for terms like aerobic, carbs, sodium, sleep, or poles.
vi: Thử tìm aerobic, carbs, sodium, ngủ hoặc gậy.

source: Try searching with the exact spelling used during race registration.
vi: Thử tìm đúng cách viết khi đăng ký Race.

source: Tue
vi: T3

source: Tuesday
vi: Thứ Ba

source: Turned off
vi: Đã tắt

source: Two hard sessions on {day} (week {week}).
vi: Hai buổi nặng vào {day} (tuần {week}).

source: ULTRA PINNACLE
vi: ĐỈNH CAO ULTRA

source: ULTRAS COMPLETED
vi: SỐ ULTRA HOÀN THÀNH

source: UTMB Index & Field Ranking
vi: UTMB Index & thứ hạng

source: UTMB verified
vi: Đã xác minh UTMB

source: Undo done
vi: Bỏ đánh dấu xong

source: Unexpected response from the server.
vi: Máy chủ trả về dữ liệu không như mong đợi.

source: Unhelpful response
vi: Câu trả lời chưa hữu ích

source: Unlink
vi: Hủy liên kết

source: Update Schedule Preferences (Optional)
vi: Cập nhật lịch tập (không bắt buộc)

source: Upper limit of Zone 2 (Easy). Conversational effort, key aerobic base for ultra trail endurance.
vi: Ngưỡng trên Zone 2 (Easy). Mức nói chuyện được, nền Aerobic quan trọng cho Ultra Trail.

source: Upper limit of Zone 4 / Lactate Threshold (LTHR). Maximum effort sustainable for ~1 hour.
vi: Ngưỡng trên Zone 4 / ngưỡng lactate (LTHR). Mức gắng sức tối đa giữ được khoảng 1 giờ.

source: Use AI generator
vi: Dùng AI tạo

source: Use Case
vi: Mục đích dùng

source: Use for Plan
vi: Dùng cho plan

source: Use plan race: %@
vi: Dùng Race của plan: %@

source: Used
vi: Đang dùng

source: Used to calculate your remaining acute fatigue and recovery phase.
vi: Dùng để tính độ mệt còn lại và giai đoạn hồi phục.

source: VERT
vi: D+

source: VO2max, COROS race prediction and easy pace
vi: VO2max, dự đoán Race của COROS và pace Easy

source: VOLUME COMPARISON
vi: SO SÁNH KHỐI LƯỢNG

source: Verified
vi: Đã xác minh

source: Verified GPX
vi: GPX đã xác minh

source: Very Light
vi: Rất nhẹ

source: Very fatigued — need real rest
vi: Rất mệt, cần nghỉ thật sự

source: Very light / recovery. Fresh legs, low fatigue.
vi: Rất nhẹ / hồi phục. Chân nhẹ, ít mệt.

source: Very light / recovery. You felt fresh and recovered easily.
vi: Rất nhẹ / hồi phục. Bạn thấy sung sức và hồi phục dễ.

source: View
vi: Xem

source: View %lld sources
vi: Xem %lld nguồn

source: View Mode
vi: Chế độ xem

source: View Original Source
vi: Xem nguồn gốc

source: View Plan
vi: Xem plan

source: Viewing & managing plan as coach
vi: Đang xem & quản lý plan với vai trò coach

source: Visualizing your aerobic (AeT) and anaerobic (AnT) thresholds from resting to max.
vi: Hiển thị ngưỡng Aerobic (AeT) và Anaerobic (AnT) từ lúc nghỉ tới tối đa.

source: Volume by day of week
vi: Khối lượng theo ngày trong tuần

source: WAYPOINT
vi: ĐIỂM MỐC

source: WEEK %lld
vi: TUẦN %lld

source: WEEKLY VOLUME
vi: KHỐI LƯỢNG TUẦN

source: WHAT WE USE
vi: DỮ LIỆU SỬ DỤNG

source: WHERE YOU TRAIN
vi: NƠI BẠN TẬP

source: Waiting for your coach's approval
vi: Đang chờ coach duyệt

source: Warm up 10 min easy, then...
vi: Warm-up 10 phút nhẹ, sau đó...

source: Was this fueling plan helpful?
vi: Kế hoạch Fueling này có hữu ích không?

source: Watch 8-week training volume
vi: Khối lượng 8 tuần từ đồng hồ

source: Watch synced · Up to date
vi: Đã đồng bộ đồng hồ · Mới nhất

source: We can't estimate a finish time yet.
vi: Chưa thể ước tính thời gian về đích.

source: We couldn't build your plan
vi: Không tạo được plan

source: We couldn't start building your plan. Please try again.
vi: Không bắt đầu tạo plan được. Vui lòng thử lại.

source: We lost track of your plan while the server restarted. Check the Plan tab; if nothing is there, try again.
vi: Mất dấu plan khi máy chủ khởi động lại. Xem tab Plan; nếu chưa có gì, hãy thử lại.

source: Weather Temperature
vi: Nhiệt độ thời tiết

source: Wed
vi: T4

source: Wednesday
vi: Thứ Tư

source: Week
vi: Tuần

source: Week %lld
vi: Tuần %lld

source: Week %lld Review
vi: Đánh giá tuần %lld

source: Week %lld Schedule
vi: Lịch tuần %lld

source: Week %lld Volume
vi: Khối lượng tuần %lld

source: Week %lld is ready to generate
vi: Tuần %lld đã sẵn sàng để tạo

source: Week %lld of %lld
vi: Tuần %lld / %lld

source: Week days volume
vi: Khối lượng các ngày

source: Week updated
vi: Đã cập nhật tuần

source: Week {week} volume changes from {before} to {after} min.
vi: Khối lượng tuần {week} đổi từ {before} thành {after} phút.

source: Weekly Schedule
vi: Lịch tuần

source: Weekly Sessions:
vi: Số buổi/tuần:

source: Weekly Volume
vi: Khối lượng tuần

source: Weekly volume
vi: Khối lượng tuần

source: Weekly volume trend
vi: Xu hướng khối lượng tuần

source: Weeks to Race
vi: Số tuần tới Race

source: Weeks to race
vi: Số tuần tới Race

source: Weight
vi: Cân nặng

source: Weight: %@
vi: Cân nặng: %@

source: Went well
vi: Tốt

source: What are you training for?
vi: Bạn đang tập cho mục tiêu gì?

source: What is Muscular Endurance (ME)?
vi: Muscular Endurance (ME) là gì?

source: What this is based on
vi: Dựa trên

source: What's going on?
vi: Có chuyện gì vậy?

source: What's on for week %lld?
vi: Tuần %lld có gì?

source: When did you finish?
vi: Bạn về đích khi nào?

source: When disconnecting, data received from COROS is permanently deleted within 24 hours.
vi: Khi ngắt kết nối, dữ liệu nhận từ COROS sẽ bị xóa vĩnh viễn trong 24 giờ.

source: When do you want to start?
vi: Bạn muốn bắt đầu khi nào?

source: When is it?
vi: Khi nào diễn ra?

source: Which race did you just finish?
vi: Bạn vừa chạy Race nào?

source: Which race?
vi: Race nào?

source: Why:
vi: Lý do:

source: Wide
vi: Rộng

source: Width
vi: Độ rộng

source: Width / Foot Shape
vi: Độ rộng / form chân

source: Window:
vi: Khoảng:

source: Winner
vi: Người thắng

source: Women
vi: Nữ

source: Workout
vi: Buổi tập

source: Workout Type
vi: Loại buổi tập

source: Workout Type Mix
vi: Tỷ lệ loại buổi tập

source: Workouts can only move between this week and next week.
vi: Chỉ chuyển được buổi tập trong tuần này và tuần sau.

source: Workouts pending approval
vi: Buổi tập chờ duyệt

source: YOUR EASY PACE
vi: PACE EASY CỦA BẠN

source: YOUR RACES (%lld)
vi: RACE CỦA BẠN (%lld)

source: Yes
vi: Có

source: You
vi: Bạn

source: You can add heart rate, paces and injuries after this. They make each new week more accurate.
vi: Sau bước này bạn có thể thêm nhịp tim, pace và chấn thương. Các thông tin đó giúp mỗi tuần mới chính xác hơn.

source: You can't move a workout to a day that has already passed.
vi: Không thể chuyển buổi tập sang ngày đã qua.

source: You have a coach — ask them to change your schedule.
vi: Bạn có coach. Hãy nhờ coach đổi lịch.

source: You haven't completed 70% of the current block yet.
vi: Bạn chưa hoàn thành 70% Block hiện tại.

source: You're offline. Changes need a connection.
vi: Bạn đang offline. Cần có mạng để thay đổi.

source: You've reached today's limit for sending to COROS. Try again tomorrow.
vi: Bạn đã hết lượt gửi sang COROS hôm nay. Thử lại ngày mai.

source: You've used today's goal checks. Try again tomorrow.
vi: Bạn đã dùng hết lượt kiểm tra mục tiêu hôm nay. Thử lại ngày mai.

source: Your Aerobic Endurance upper limit is AeT; your Threshold zone limit is AnT.
vi: Ngưỡng trên sức bền Aerobic là AeT; ngưỡng zone Threshold là AnT.

source: Your Athletes
vi: Học viên của bạn

source: Your Profile
vi: Hồ sơ của bạn

source: Your adaptive training plan for the mountains.
vi: Plan tập luyện tự điều chỉnh cho chạy trail.

source: Your current plan stays in Recent plans. The new plan becomes your active plan.
vi: Plan hiện tại vẫn nằm trong Plan gần đây. Plan mới sẽ thành plan đang chạy.

source: Your finishing rank on this field
vi: Thứ hạng của bạn ở giải này

source: Your first week starts close to what you already do.
vi: Tuần đầu sẽ gần với mức bạn đang tập.

source: Your past workouts and health metrics from COROS will no longer automatically sync.
vi: Buổi tập và chỉ số sức khỏe từ COROS sẽ không còn tự đồng bộ.

source: Your plan changed since this was proposed.
vi: Plan đã thay đổi kể từ khi đề xuất.

source: Your plan is built around
vi: Plan của bạn được xây quanh

source: Your plan is ready
vi: Plan đã sẵn sàng

source: Your session expired. Please sign in again.
vi: Phiên đăng nhập đã hết hạn. Vui lòng đăng nhập lại.

source: Your session has expired. Please sign in again.
vi: Phiên đăng nhập đã hết hạn. Vui lòng đăng nhập lại.

source: Your target:
vi: Mục tiêu của bạn:

source: Your training paces won't change until your next week is built.
vi: Pace tập sẽ không đổi cho tới khi tạo tuần tiếp theo.

source: Your weekly workouts show up here once Coach Uphill builds your plan.
vi: Buổi tập hằng tuần sẽ hiện ở đây khi Coach Uphill tạo xong plan.

source: Zone 1 · Recovery
vi: Zone 1 · Hồi phục

source: Zone 2 Pace Range:
vi: Khoảng pace Zone 2:

source: Zone 2 pace
vi: Pace Zone 2

source: Zone 2 upper limit is AeT; Zone 4 upper limit is AnT.
vi: Ngưỡng trên Zone 2 là AeT; ngưỡng trên Zone 4 là AnT.

source: Zone 2 · Aerobic Base
vi: Zone 2 · Nền Aerobic

source: Zone 5 · VO2max / Speed
vi: Zone 5 · VO2max / tốc độ

source: Zone Category
vi: Nhóm zone

source: Zone model
vi: Mô hình zone

source: day ago
vi: ngày trước

source: days ago
vi: ngày trước

source: e.g. 10.0
vi: vd. 10.0

source: e.g. 1200
vi: vd. 1200

source: e.g. 42
vi: vd. 42

source: e.g. 60
vi: vd. 60

source: e.g. Aerobic Base Run + Strides
vi: vd. Aerobic Base Run + Strides

source: e.g. Travel, illness, race postponed, sore calf...
vi: vd. Đi xa, ốm, Race hoãn, đau bắp chân...

source: e.g. runner's knee, IT band tightness, recent ankle sprain...
vi: vd. đau gối, căng dải IT, mới lật cổ chân...

source: km / week
vi: km / tuần

source: min
vi: phút

source: or
vi: hoặc

source: runs / week
vi: buổi / tuần

source: the upcoming weeks
vi: các tuần tới

source: week
vi: tuần

source: workout
vi: buổi tập

source: years
vi: tuổi

source: · %lld weeks to go
vi: · còn %lld tuần

source: · %lld%% wear
vi: · mòn %lld%%

source: · Pick: %@
vi: · Chọn: %@

source: “Solid volume progression. Remember: recovery is where adaptation happens. Do not cut rest short on heavy training blocks.”
vi: “Khối lượng tăng đều. Nhớ: cơ thể thích nghi khi hồi phục. Đừng cắt bớt nghỉ ở các Block nặng.”

source: “{title}” is still pending coach review.
vi: “{title}” vẫn đang chờ coach duyệt.

source: • First 30%: Discipline in low Zone 2. Bank zero lactate on early climbs. • Middle 40%: Settle into steady rhythm, fuel every 30 mins. • Final 30%: Empty the tank on runnable sections if quads allow.
vi: • 30% đầu: Giữ kỷ luật ở Zone 2 thấp. Không tích lactate ở các dốc đầu. • 40% giữa: Giữ nhịp đều, Fueling mỗi 30 phút. • 30% cuối: Dốc hết sức ở đoạn chạy được nếu đùi còn cho phép.

source: − Hide extra unlinked result
vi: − Ẩn kết quả chưa liên kết
